<?php

return [
    'title' => 'Моя музыка',
    'upload_title' => '🎵 Загрузка музыки',
    'select_file' => 'Выберите аудиофайл (MP3, WAV, OGG, до 128 МБ)',
    'btn_upload' => 'Загрузить',
    'no_permission' => 'У вас нет прав для загрузки музыки.',
    'my_tracks' => '📋 Ваши загруженные треки',
    'empty' => 'Вы еще не загрузили ни одного трека.',
    'uploaded_at' => 'Загружено',
    'btn_copy' => '📋 Копировать',
    'btn_copied' => '✅ Скопировано!',
    'btn_delete' => 'Удалить',
    'confirm_delete' => 'Вы уверены, что хотите удалить этот трек?',
    
    // Сообщения об успешных действиях / ошибках
    'success_upload' => 'Песня успешно загружена!',
    'success_delete' => 'Трек успешно удален!',
    'error_upload' => 'Ошибка при загрузке файла.',
    'error_copy_console' => 'Ошибка при копировании.',
    'error_copy' => 'Не удалось скопировать ссылку автоматически. Скопируйте её вручную: ',
    'limit_error' => 'Администратор установил лимит на загрузку. Удалите старые треки!',
	
	// Админка
	'role' => 'Загрузка музыки',
	'adm_music_control' => 'Управление музыкой',
	'adm_all_music' => 'Все загруженные треки',
	'adm_user' => 'Игрок',
	'adm_file' => 'Название файла',
	'adm_date' => 'Дата загрузки',
	'adm_action' => 'Действие',
	'adm_del_user' => 'Удаленный пользователь',
	
];
